docs/qa/local-load-soak-test/raw/k6-smoke-20260808-033759.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/mixed-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 1m30s max duration (incl. graceful stop):
              * mixed: 2 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
mixed   [   1% ] 2 VUs  0m00.6s/1m0s

running (0m02.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
mixed   [   3% ] 2 VUs  0m01.6s/1m0s

running (0m03.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
mixed   [   4% ] 2 VUs  0m02.6s/1m0s

running (0m04.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
mixed   [   6% ] 2 VUs  0m03.6s/1m0s

running (0m05.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
mixed   [   8% ] 2 VUs  0m04.6s/1m0s

running (0m06.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
mixed   [   9% ] 2 VUs  0m05.6s/1m0s

running (0m07.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
mixed   [  11% ] 2 VUs  0m06.6s/1m0s

running (0m08.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
mixed   [  13% ] 2 VUs  0m07.6s/1m0s

running (0m09.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
mixed   [  14% ] 2 VUs  0m08.6s/1m0s

running (0m10.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
mixed   [  16% ] 2 VUs  0m09.6s/1m0s

running (0m11.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
mixed   [  18% ] 2 VUs  0m10.6s/1m0s

running (0m12.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
mixed   [  19% ] 2 VUs  0m11.6s/1m0s

running (0m13.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
mixed   [  21% ] 2 VUs  0m12.6s/1m0s

running (0m14.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
mixed   [  23% ] 2 VUs  0m13.6s/1m0s

running (0m15.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
mixed   [  24% ] 2 VUs  0m14.6s/1m0s

running (0m16.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
mixed   [  26% ] 2 VUs  0m15.6s/1m0s

running (0m17.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
mixed   [  28% ] 2 VUs  0m16.6s/1m0s

running (0m18.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
mixed   [  29% ] 2 VUs  0m17.6s/1m0s

running (0m19.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
mixed   [  31% ] 2 VUs  0m18.6s/1m0s

running (0m20.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
mixed   [  33% ] 2 VUs  0m19.6s/1m0s

running (0m21.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
mixed   [  34% ] 2 VUs  0m20.6s/1m0s

running (0m22.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
mixed   [  36% ] 2 VUs  0m21.6s/1m0s

running (0m23.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
mixed   [  38% ] 2 VUs  0m22.6s/1m0s

running (0m24.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
mixed   [  39% ] 2 VUs  0m23.6s/1m0s

running (0m25.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
mixed   [  41% ] 2 VUs  0m24.6s/1m0s

running (0m26.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
mixed   [  43% ] 2 VUs  0m25.6s/1m0s

running (0m27.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
mixed   [  44% ] 2 VUs  0m26.6s/1m0s

running (0m28.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
mixed   [  46% ] 2 VUs  0m27.6s/1m0s

running (0m29.0s), 2/2 VUs, 17 complete and 0 interrupted iterations
mixed   [  48% ] 2 VUs  0m28.6s/1m0s

running (0m30.0s), 2/2 VUs, 17 complete and 0 interrupted iterations
mixed   [  49% ] 2 VUs  0m29.6s/1m0s

running (0m31.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
mixed   [  51% ] 2 VUs  0m30.6s/1m0s

running (0m32.0s), 2/2 VUs, 19 complete and 0 interrupted iterations
mixed   [  53% ] 2 VUs  0m31.6s/1m0s

running (0m33.0s), 2/2 VUs, 19 complete and 0 interrupted iterations
mixed   [  54% ] 2 VUs  0m32.6s/1m0s

running (0m34.0s), 2/2 VUs, 19 complete and 0 interrupted iterations
mixed   [  56% ] 2 VUs  0m33.6s/1m0s

running (0m35.0s), 2/2 VUs, 19 complete and 0 interrupted iterations
mixed   [  58% ] 2 VUs  0m34.6s/1m0s

running (0m36.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
mixed   [  59% ] 2 VUs  0m35.6s/1m0s

running (0m37.0s), 2/2 VUs, 21 complete and 0 interrupted iterations
mixed   [  61% ] 2 VUs  0m36.6s/1m0s

running (0m38.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
mixed   [  63% ] 2 VUs  0m37.6s/1m0s

running (0m39.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
mixed   [  64% ] 2 VUs  0m38.6s/1m0s

running (0m40.0s), 2/2 VUs, 23 complete and 0 interrupted iterations
mixed   [  66% ] 2 VUs  0m39.6s/1m0s

running (0m41.0s), 2/2 VUs, 23 complete and 0 interrupted iterations
mixed   [  68% ] 2 VUs  0m40.6s/1m0s

running (0m42.0s), 2/2 VUs, 25 complete and 0 interrupted iterations
mixed   [  69% ] 2 VUs  0m41.6s/1m0s

running (0m43.0s), 2/2 VUs, 25 complete and 0 interrupted iterations
mixed   [  71% ] 2 VUs  0m42.6s/1m0s

running (0m44.0s), 2/2 VUs, 25 complete and 0 interrupted iterations
mixed   [  73% ] 2 VUs  0m43.6s/1m0s

running (0m45.0s), 2/2 VUs, 27 complete and 0 interrupted iterations
mixed   [  74% ] 2 VUs  0m44.6s/1m0s

running (0m46.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
mixed   [  76% ] 2 VUs  0m45.6s/1m0s

running (0m47.0s), 2/2 VUs, 29 complete and 0 interrupted iterations
mixed   [  78% ] 2 VUs  0m46.6s/1m0s

running (0m48.0s), 2/2 VUs, 29 complete and 0 interrupted iterations
mixed   [  79% ] 2 VUs  0m47.6s/1m0s

running (0m49.0s), 2/2 VUs, 29 complete and 0 interrupted iterations
mixed   [  81% ] 2 VUs  0m48.6s/1m0s

running (0m50.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
mixed   [  83% ] 2 VUs  0m49.6s/1m0s

running (0m51.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
mixed   [  84% ] 2 VUs  0m50.6s/1m0s

running (0m52.0s), 2/2 VUs, 31 complete and 0 interrupted iterations
mixed   [  86% ] 2 VUs  0m51.6s/1m0s

running (0m53.0s), 2/2 VUs, 31 complete and 0 interrupted iterations
mixed   [  88% ] 2 VUs  0m52.6s/1m0s

running (0m54.0s), 2/2 VUs, 32 complete and 0 interrupted iterations
mixed   [  89% ] 2 VUs  0m53.6s/1m0s

running (0m55.0s), 2/2 VUs, 33 complete and 0 interrupted iterations
mixed   [  91% ] 2 VUs  0m54.6s/1m0s

running (0m56.0s), 2/2 VUs, 33 complete and 0 interrupted iterations
mixed   [  93% ] 2 VUs  0m55.6s/1m0s

running (0m57.0s), 2/2 VUs, 33 complete and 0 interrupted iterations
mixed   [  94% ] 2 VUs  0m56.6s/1m0s

running (0m58.0s), 2/2 VUs, 34 complete and 0 interrupted iterations
mixed   [  96% ] 2 VUs  0m57.6s/1m0s

running (0m59.0s), 2/2 VUs, 35 complete and 0 interrupted iterations
mixed   [  98% ] 2 VUs  0m58.6s/1m0s

running (1m00.0s), 2/2 VUs, 35 complete and 0 interrupted iterations
mixed   [  99% ] 2 VUs  0m59.6s/1m0s

running (1m01.0s), 2/2 VUs, 35 complete and 0 interrupted iterations
mixed ↓ [ 100% ] 2 VUs  1m0s

running (1m02.0s), 2/2 VUs, 35 complete and 0 interrupted iterations
mixed ↓ [ 100% ] 2 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=33.18ms
    ✓ 'p(99)<1500' p(99)=204.76ms

    http_req_failed
    ✗ 'rate<0.01' rate=1.39%


  █ TOTAL RESULTS 

    checks_total.......: 570    9.141329/s
    checks_succeeded...: 99.29% 566 out of 570
    checks_failed......: 0.70%  4 out of 570

    ✓ 로그인 envelope success=true
    ✓ 로그인 token 존재
    ✗ 2xx 응답
      ↳  99% — ✓ 278 / ✗ 2
    ✗ ApiResponse success=true
      ↳  99% — ✓ 278 / ✗ 2

    CUSTOM
    samhan_http_4xx................: 2      0.032075/s

    HTTP
    http_req_duration..............: avg=19.28ms min=5.47ms med=12.4ms  max=229.94ms p(90)=21.78ms p(95)=33.18ms
      { expected_response:true }...: avg=19.29ms min=5.47ms med=12.42ms max=229.94ms p(90)=21.68ms p(95)=32.44ms
    http_req_failed................: 1.39%  4 out of 287
    http_reqs......................: 287    4.602739/s

    EXECUTION
    iteration_duration.............: avg=3.34s   min=1.22s  med=3.59s   max=5.1s     p(90)=4.88s   p(95)=4.96s  
    iterations.....................: 37     0.593385/s
    vus............................: 2      min=2        max=2
    vus_max........................: 2      min=2        max=2

    NETWORK
    data_received..................: 643 kB 10 kB/s
    data_sent......................: 142 kB 2.3 kB/s



running (1m02.4s), 0/2 VUs, 37 complete and 0 interrupted iterations
mixed ✓ [ 100% ] 2 VUs  1m0s
time="2026-08-07T18:39:03Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"